Типы данных в Python
######################

**Тип данных** (тип) — множество значений и операций над этими значениями

В Python есть несколько стандартных типов данных:

- Numbers (числа)
- Strings (строки)
- Lists (списки)
- Dictionaries (словари)
- Tuples (кортежи)
- Sets (множества)
- Boolean (логический тип данных)

Эти типы данных можно, в свою очередь, классифицировать по нескольким признакам:

- изменяемые (списки, словари и множества)
- неизменяемые (числа, строки и кортежи)
- упорядоченные (списки, кортежи, строки и словари)
- неупорядоченные (множества)

.. toctree::
   :maxdepth: 4
   :caption: Оглавление

   01_num/type_number
   02_bool/type_bool
   03_str/type_str
   04_list/type_list
   05_dict/type_dict
   06_dict/type_tuple
